---
title: CurtainGridFamilyFailures
classe: Autodesk.Revit.DB.BuiltInFailures+CurtainGridFamilyFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 20
---

# CurtainGridFamilyFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AllMullionsAreTooShort { get; }` | `CurtainGridFamilyFailures.AllMullionsAreTooShort` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCornerMullionDueAngle { get; }` | `CurtainGridFamilyFailures.CannotCreateCornerMullionDueAngle` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCurtainPanelCorruption { get; }` | `CurtainGridFamilyFailures.CannotCreateCurtainPanelCorruption` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCurtainPanelError { get; }` | `CurtainGridFamilyFailures.CannotCreateCurtainPanelError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCurtainPanelInOpeningCorruption { get; }` | `CurtainGridFamilyFailures.CannotCreateCurtainPanelInOpeningCorruption` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCurtainPanelInOpeningWarning { get; }` | `CurtainGridFamilyFailures.CannotCreateCurtainPanelInOpeningWarning` | FailureDefinitionId |
| `FailureDefinitionId CannotGenerateAllNecessaryElements { get; }` | `CurtainGridFamilyFailures.CannotGenerateAllNecessaryElements` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceSystemMullionFamilyOnCurtainWall { get; }` | `CurtainGridFamilyFailures.CannotPlaceSystemMullionFamilyOnCurtainWall` | FailureDefinitionId |
| `FailureDefinitionId CannotPlaceSystemPanelsInOldArcedCurtainWalls { get; }` | `CurtainGridFamilyFailures.CannotPlaceSystemPanelsInOldArcedCurtainWalls` | FailureDefinitionId |
| `FailureDefinitionId CornerMullionOverlapsOtherOnePlacedOnNeighboringRegion { get; }` | `CurtainGridFamilyFailures.CornerMullionOverlapsOtherOnePlacedOnNeighboringRegion` | FailureDefinitionId |
| `FailureDefinitionId CornerMullionsNeighborsMustBeTangent { get; }` | `CurtainGridFamilyFailures.CornerMullionsNeighborsMustBeTangent` | FailureDefinitionId |
| `FailureDefinitionId CurtainPanelNotBelongsToElement { get; }` | `CurtainGridFamilyFailures.CurtainPanelNotBelongsToElement` | FailureDefinitionId |
| `FailureDefinitionId CurtainPanelsParamDefinedTypeDefinedCirculary { get; }` | `CurtainGridFamilyFailures.CurtainPanelsParamDefinedTypeDefinedCirculary` | FailureDefinitionId |
| `FailureDefinitionId CurtainSystemCouldnotReacquireFaces { get; }` | `CurtainGridFamilyFailures.CurtainSystemCouldnotReacquireFaces` | FailureDefinitionId |
| `FailureDefinitionId InvalidCurtainPanelInModel { get; }` | `CurtainGridFamilyFailures.InvalidCurtainPanelInModel` | FailureDefinitionId |
| `FailureDefinitionId MullionProfileContainsOpenLoop { get; }` | `CurtainGridFamilyFailures.MullionProfileContainsOpenLoop` | FailureDefinitionId |
| `FailureDefinitionId NonSystemPanelFamiliesCannotBeUsed { get; }` | `CurtainGridFamilyFailures.NonSystemPanelFamiliesCannotBeUsed` | FailureDefinitionId |
| `FailureDefinitionId PanelsSlightlyMalformedCorruption { get; }` | `CurtainGridFamilyFailures.PanelsSlightlyMalformedCorruption` | FailureDefinitionId |
| `FailureDefinitionId PanelsSlightlyMalformedWarning { get; }` | `CurtainGridFamilyFailures.PanelsSlightlyMalformedWarning` | FailureDefinitionId |
| `FailureDefinitionId SomeMullionsAreTooShort { get; }` | `CurtainGridFamilyFailures.SomeMullionsAreTooShort` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```